app/controllers/geonames_controller.rb

SELECT "geonames".* FROM "geonames"
---
  def index
    @geonames = Geoname.search(params)

SELECT "geonames".* FROM "geonames" ORDER BY "geonames"."id" DESC LIMIT 1
---
  def map
    # @coordinates = Geoname.new
    @geoname = Geoname.search(params)

SELECT "geonames".* FROM "geonames" WHERE "geonames"."feature_id" = 78956 LIMIT 1
---
  def show
    @geoname = Geoname.find_by_feature_id(params[:id])

SELECT "geonames".* FROM "geonames" WHERE "geonames"."feature_name" IS NULL
---
  def create
    # @place = Geoname.new(params[:place])
    # @place.save

    @geoname = Geoname.find_all_by_feature_name(params[:feature_name])